Revit 2027 API
BoundaryConditions.SetLoops Method
 Sets the curve loops that define geometry of the area boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetLoops(
	IList<CurveLoop> newLoops
)
Public Function SetLoops (
	newLoops As IList(Of CurveLoop)
) As Boolean
public:
bool SetLoops(
	IList<CurveLoop^>^ newLoops
)
member SetLoops :
        newLoops : IList<CurveLoop> -> bool
Parameters
newLoops IList<CurveLoop>
 Loops that define new geometry of the area boundary conditions. The curve loop collection should contain only closed loops.
Return Value
Boolean
 Returns true if successful, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  One of the following requirements is not satisfied : - curve loops newLoops are not planar - curve loops newLoops are self-intersecting - curve loops newLoops contains zero length curves
ArgumentNullException |  A non-optional argument was null
InvalidObjectException |  Boundary condition is not a BoundaryConditionsType::Area type.
InvalidOperationException |  This BoundaryConditions is not a hosted object. -or- This BoundaryConditions is constrained on host.
Remarks
 This method works for boundary conditions which are not constrained to their host. This method works with hosted area boundary conditions only. Curve Loop must be planar and not self-intersecting.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace